// Напишите программу, которая выводит на консоль простые числа
// в промежутке от [2, 100].
// Используйте для решения этой задачи оператор 
// "%" (остаток от деления) и циклы.

public class PrimeNums {
    public static void main(String[] args) throws Exception {
        // чистит консоль
        System.out.print("\033[H\033[2J");
        System.out.flush();

        System.out.println("Hello, World!");
    }
}
